#+TITLE: 图解性能优化
#+AUTHOR: lujun9972
#+TAGS: linux
#+DATE: [2017-07-27 四 17:25]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

#+INTERLEAVE_PDF: /home/lujun9972/电子书/linux书籍/图解性能优化.pdf
*** vmstat
:PROPERTIES:
:interleave_page_note: 81
:END:

获取等待执行的平均进程数、等待的平均进程数、CPU使用率、对Swap空间的I/O、通常的I/O、上下文切换次数等。

由于获取的也是概要形式，因此也常与top等获取快照信息的命令一起使用。

比起CPU使用率，等待执行的平均进程数（r列）和被阻塞的进程数（b列）更值得关注。

特别要留意wa列，它一般会被作为I/O等待的指标。
#+BEGIN_SRC shell :results raw
  vmstat 
#+END_SRC

#+RESULTS:
procs -----------memory---------- ---swap-- -----io---- -system-- ------cpu-----
 r  b 交换 空闲 缓冲 缓存   si   so    bi    bo   in   cs us sy id wa st
 0  0      0 1220856  49820 764048    0    0    18    24  928  927  3  2 94  0  0


一般认为r列的值不应高于CPU核数的2倍或4倍。

*** netstat
:PROPERTIES:
:interleave_page_note: 85
:END:

使用 =-a= 参数可以获取套接字的瞬时快照，
#+BEGIN_SRC shell :dir /ssh:root@wulin:~/ :results raw
netstat -a |head
#+END_SRC

#+RESULTS:
Active Internet connections (servers and established)
Proto Recv-Q Send-Q Local Address           Foreign Address         State      
tcp        0      0 0.0.0.0:mysql           0.0.0.0:*               LISTEN     
tcp        0      0 0.0.0.0:29100           0.0.0.0:*               LISTEN     
tcp        0      0 0.0.0.0:29712           0.0.0.0:*               LISTEN     
tcp        0      0 0.0.0.0:29300           0.0.0.0:*               LISTEN     
tcp        0      0 0.0.0.0:29301           0.0.0.0:*               LISTEN     
tcp        0      0 0.0.0.0:ssh             0.0.0.0:*               LISTEN     
tcp        0      0 0.0.0.0:29400           0.0.0.0:*               LISTEN     
tcp        0      0 0.0.0.0:29401           0.0.0.0:*               LISTEN     

使用 =-r= 参数可以获取路由的瞬时快照，
#+BEGIN_SRC shell :dir /ssh:root@wulin:~/ :results raw
netstat -r
#+END_SRC

#+RESULTS:
Kernel IP routing table
Destination     Gateway         Genmask         Flags   MSS Window  irtt Iface
default         gateway         0.0.0.0         UG        0 0          0 eth0
link-local      0.0.0.0         255.255.0.0     U         0 0          0 eth0
169.254.169.254 gateway         255.255.255.255 UGH       0 0          0 eth0
192.168.0.0     0.0.0.0         255.255.255.0   U         0 0          0 eth0

使用 =i= 参数可以获取各个接口的统计信息。
#+BEGIN_SRC shell :dir /ssh:root@wulin:~/ :results raw
netstat -i
#+END_SRC

#+RESULTS:
Kernel Interface table
Iface      MTU    RX-OK RX-ERR RX-DRP RX-OVR    TX-OK TX-ERR TX-DRP TX-OVR Flg
eth0      1500   521207      0      0 0        285050      0      0      0 BMRU
lo       65536  1776618      0      0 0       1776618      0      0      0 LRU

当感觉网络性能异常时，应该查看使用这个网络通信的应用程序的性能日志，或者使用网络抓包获取事件形式的日志。

